# 3. SQL Queries

In this section, we will cover SQL queries which allow us to add and retrive data from a table. As usual, let us connect to the database,

In [3]:
# Using prettytable to display tables,
import prettytable

# Creating connection,
%load_ext sql
%sql sqlite:///database.db

### 3.1 Select Query

As seen before, we have used **SELECT** to extract all rows and columns from a given table in `SELECT * FROM table_name`. This is a special case of the full syntax which is `SELECT column1, column2, column3, ..., columnN FROM table_name`. With this, we can be selective about which fields we want our rows to include. Futhermore, note that we also used **WHERE** to provide additional conditions. Therefore, the full stucture of the most basic yet powerful query in SQL is of the form:

`SELECT column1, column2, column3, ..., columnN FROM table_name WHERE condition1 AND/OR condition2 AND/OR condition3 ... AND/OR conditionN`

In [4]:
%%sql

SELECT ID, FirstName, LastName FROM customer_data WHERE Sex="male" AND Package="Standard";

 * sqlite:///database.db
Done.

[(6, 'Frank', 'Miller'),
 (11, 'Liam', 'Evans'),
 (17, 'James', 'Lewis'),
 (22, 'Mark', 'Thompson'),
 (28, 'Ethan', 'Baker')]

We can give field names an alias using **AS** when returning the rows, this is useful when a field name is difficult to read or understand.

In [5]:
%%sql

SELECT ID, FirstName AS Name FROM customer_data WHERE Sex="male" AND Package="Standard";

 * sqlite:///database.db
Done.

[(6, 'Frank'), (11, 'Liam'), (17, 'James'), (22, 'Mark'), (28, 'Ethan')]

Using **CONCAT**, short for concatenation, we can combine fields together,

In [6]:
%%sql

SELECT ID, CONCAT(FirstName, " ", LastName) AS Name FROM customer_data WHERE Sex="male" AND Package="Standard";

 * sqlite:///database.db
Done.

[(6, 'Frank Miller'),
 (11, 'Liam Evans'),
 (17, 'James Lewis'),
 (22, 'Mark Thompson'),
 (28, 'Ethan Baker')]

Note that, the field name of the concatation is set to default as `Concat(object1, object2, ..., objectN)` if we do not provide an alias. As shown in the example above, we can also include other data types to be concated with our field values.